aaron-bond.better-comments
alefragnani.project-manager
anthropic.claude-code
anysphere.cursorpyright
anysphere.remote-containers
anysphere.remote-ssh
astro-build.astro-vscode
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
eamodio.gitlens
esbenp.prettier-vscode
github.vscode-github-actions
golang.go
google.geminicodeassist
hashicorp.terraform
jetify.devbox
kisstkondoros.vscode-gutter-preview
miguelsolorio.symbols
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.vscode-typescript-next
nomicfoundation.hardhat-solidity
openai.chatgpt
pomdtr.excalidraw-editor
prisma.prisma
raunofreiberg.vesper
redhat.vscode-yaml
streetsidesoftware.code-spell-checker
usernamehw.errorlens
wix.vscode-import-cost
yoavbls.pretty-ts-errors
